<a href="https://colab.research.google.com/github/edgaryoungpilo-web/colab-files/blob/main/Practica_17_266659.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# Práctica 17: Limpieza y Transformación de Datos Categóricos

# Importacion de archivo

In [36]:
import pandas as pd

ruta = "/content/drive/MyDrive/ClassFiles/nls97.csv"
df = pd.read_csv(ruta)

df.head()

,personid,gender,birthmonth,birthyear,highestgradecompleted,maritalstatus,childathome,childnotathome,wageincome,weeklyhrscomputer,...,colenrfeb13,colenroct13,colenrfeb14,colenroct14,colenrfeb15,colenroct15,colenrfeb16,colenroct16,colenrfeb17,colenroct17
0,100061,Female,5,1980,13.0,Married,4.0,0.0,12500.0,10 hours or more a week,...,1. Not enrolled,1. Not enrolled,1. Not enrolled,1. Not enrolled,1. Not enrolled,1. Not enrolled,1. Not enrolled,1. Not enrolled,1. Not enrolled,1. Not enrolled
1,100139,Male,9,1983,12.0,Married,2.0,0.0,120000.0,1 to 3 hours a week,...,1. Not enrolled,1. Not enrolled,1. Not enrolled,1. Not enrolled,1. Not enrolled,1. Not enrolled,1. Not enrolled,1. Not enrolled,1. Not enrolled,1. Not enrolled
2,100284,Male,11,1984,7.0,Never-married,1.0,0.0,58000.0,NaN,...,1. Not enrolled,1. Not enrolled,1. Not enrolled,1. Not enrolled,1. Not enrolled,1. Not enrolled,1. Not enrolled,1. Not enrolled,1. Not enrolled,1. Not enrolled
3,100292,Male,4,1982,NaN,NaN,NaN,NaN,NaN,NaN,...,1. Not enrolled,1. Not enrolled,1. Not enrolled,1. Not enrolled,1. Not enrolled,1. Not enrolled,NaN,NaN,NaN,NaN
4,100583,Male,1,1980,13.0,Married,4.0,0.0,30000.0,Less than 1 hour a week,...,1. Not enrolled,1. Not enrolled,1. Not enrolled,1. Not enrolled,1. Not enrolled,1. Not enrolled,1. Not enrolled,1. Not enrolled,1. Not enrolled,1. Not enrolled

# Ejercicio 1: Errores tipograficos y valores inconsistentes

#Valores unicos

In [37]:
df['maritalstatus'].unique()

array(['Married', 'Never-married', nan, 'Divorced', 'Separated',
       'Widowed'], dtype=object)

# Frecuencia de cada valor

In [38]:
df['maritalstatus'].value_counts()

maritalstatus
Married          3066
Never-married    2766
Divorced          663
Separated         154
Widowed            23
Name: count, dtype: int64

# Cambiar 'Never-Married' a 'Single'

In [39]:
df['maritalstatus'] = df['maritalstatus'].replace('Never-Married', 'Single')

# Nueva Frecuencia

In [40]:
df['maritalstatus'].value_counts()

maritalstatus
Married          3066
Never-married    2766
Divorced          663
Separated         154
Widowed            23
Name: count, dtype: int64

# Ejercicio 2: Errores Tipográficos y Valores Inconsistentes: highestdegrees

# Nuevos valores

In [41]:
df['highestdegree'].unique()

array(['2. High School', '0. None', '4. Bachelors', '3. Associates',
       '5. Masters', '1. GED', '7. Professional', '6. PhD', nan],
      dtype=object)

# Frecuencia

In [42]:
df['highestdegree'].value_counts()

highestdegree
2. High School     3667
4. Bachelors       1673
1. GED             1146
0. None             953
3. Associates       737
5. Masters          603
7. Professional     120
6. PhD               54
Name: count, dtype: int64

Limpieza de categorias

In [43]:
df['highestdegree'] = df['highestdegree'].str.replace(r'^\d+\.\s*', '', regex=True)
df['highestdegree'] = df['highestdegree'].str.lower()

# Nuevos valores unicos

In [44]:
df['highestdegree'].unique()

array(['high school', 'none', 'bachelors', 'associates', 'masters', 'ged',
       'professional', 'phd', nan], dtype=object)

# Ejercicio 03: Alta Cardinalidad - Frecuencias Bajas

# Creacion de nueva columna marital_grouped

In [45]:
df['marital_grouped'] = df['maritalstatus'].replace({
    'Widowed': 'Single/No Partner',
    'Single': 'Single/No Partner'
})

# Valores unicos

In [46]:
df['marital_grouped'].unique()

array(['Married', 'Never-married', nan, 'Divorced', 'Separated',
       'Single/No Partner'], dtype=object)

# Frecuencia

In [47]:
df['marital_grouped'].value_counts()

marital_grouped
Married              3066
Never-married        2766
Divorced              663
Separated             154
Single/No Partner      23
Name: count, dtype: int64

# Ejercicio 04: Tipos de Datos

# Tpo de dato Gender

In [48]:
df['gender'].dtype

dtype('O')

# Cantidad de bytes que utiliza

In [49]:
df['gender'].memory_usage(deep=True)

485054

# Cambio de categoria

In [50]:
if df['gender'].dtype == 'object':
    df['gender'] = df['gender'].astype('category')

# Nueva cantidad de bytes

In [51]:
df['gender'].memory_usage(deep=True)

9332